//$TESTS   JOB (1),'SNOBOL4',NOTIFY=&SYSUID,MSGLEVEL=(1,1),REGION=3M,
//  MSGCLASS=A,COND=(0,NE)
//*
//*
//SNOBOL4  PROC
//S          EXEC PGM=SNOBOL4 PARM='T=10,R=15000,L=64000,H=200000'
//STEPLIB  DD   DISP=SHR,DSN=GRZ027.SNOBOL4.LINKLIB
//FT06F001 DD   SYSOUT=*
//FT07F001 DD   SYSOUT=B
//FT05F001 DD   DDNAME=SYSIN
//FT08F001 DD   DDNAME=SYSUT1     FOR FUN
//         PEND
//*
//HELLO   EXEC SNOBOL4
//SYSIN DD DISP=SHR,DSN=GRZ027.CBT507.FILE604(#HELLO)
//*
//* STANDARD TEST PROGRAM ADAPTED FROM SPITBOL #1
//PGM1    EXEC SNOBOL4
//SYSIN DD DISP=SHR,DSN=GRZ027.CBT507.FILE604(#PGM1)
//*
//* STANDARD TEST PROGRAM ADAPTED FROM SPITBOL #2
//PGM2    EXEC SNOBOL4
//SYSIN DD DISP=SHR,DSN=GRZ027.CBT507.FILE604(#PGM2)
//*
//* FACTORIALS
//PGM3    EXEC SNOBOL4
//SYSIN DD DISP=SHR,DSN=GRZ027.CBT507.FILE604(#PGM3)
//*
//*  A SYNTACTIC RECOGNIZER FOR SPITBOL (SNOBOL4) STATEMENTS
//PGM4    EXEC SNOBOL4
//SYSIN DD DISP=SHR,DSN=GRZ027.CBT507.FILE604(#PGM4)
//*
//*  TREESORT
//PGM5    EXEC SNOBOL4
//SYSIN DD DISP=SHR,DSN=GRZ027.CBT507.FILE604(#PGM5)
//*
//*  TOPOLOGICAL SORT
//PGM6    EXEC SNOBOL4
//SYSIN DD DISP=SHR,DSN=GRZ027.CBT507.FILE604(#PGM6)
//*
//*  SYMBOL TABLE GENERATOR
//PGM7    EXEC SNOBOL4
//SYSIN DD DISP=SHR,DSN=GRZ027.CBT507.FILE604(#PGM7)
//*
//*  BRIDGE DEALER
//PGM8    EXEC SNOBOL4
//SYSIN DD DISP=SHR,DSN=GRZ027.CBT507.FILE604(#PGM8)
//*
//*  TRUE OR NOT TRUE ...
//WANG    EXEC SNOBOL4
//SYSIN DD DISP=SHR,DSN=GRZ027.CBT507.FILE604(#WANG)
//*
//*  TOWERS OF HANOI, DO NOT TRY 64!!
//HANOI   EXEC SNOBOL4
//SYSIN DD DISP=SHR,DSN=GRZ027.CBT507.FILE604(#HANOI)
//*
//* LANGUAGE
//TRIGRAM EXEC SNOBOL4
//SYSIN DD DISP=SHR,DSN=GRZ027.CBT507.FILE604(#TRIGRAM)
//*
//*  AI DREAM
//QUINE   EXEC SNOBOL4
//SYSIN DD DISP=SHR,DSN=GRZ027.CBT507.FILE604(#QUINE)
//*
//*  AVERY SMALL SUBSET OF IEBGENER + NICE FOR FB/VB CONVERSION
//SNOCOPY EXEC SNOBOL4
//SYSIN DD DISP=SHR,DSN=GRZ027.CBT507.FILE604(#SNOCOPY)
//SYSUT1    DD *
REALLY?
BYE.
