IHCCOMH2 TITLE 'SPTS disassembly of IHCCOMH2  8/06/24'
IHCCOMH2 CSECT                           . 000000
         ENTRY SEQDASD                   . 0000CE
         LR    6,15                      . 000000 186F
         LH    4,0(,14)                  . 000002 4840 E000
         L     1,3228(,6)                . 000006 5810 6C9C
         BALR  0,1                            CALL                     *
                                         . 00000A 0501
         SPM   0                         . 00000C 0400
         B     6(,5)                     . 00000E 47F0 5006
         LA    0,206(,5)                 . 000012 4100 50CE
         L     1,188(,6)                 . 000016 5810 60BC
         CR    0,1                       . 00001A 1901
         BE    40(,5)                    . 00001C 4780 5028
         BALR  0,1                            CALL                     *
                                         . 000020 0501
         SPM   0                         . 000022 0400
         B     6(,5)                     . 000024 47F0 5006
         L     1,3272(,6)                . 000028 5810 6CC8
         CLI   0(1),X'00'                . 00002C 9500 1000
         BE    70(,5)                    . 000030 4780 5046
         MVI   0(1),X'00'                . 000034 9200 1000
         BAL   0,68(,5)                       PLIST                    *
                                         . 000038 4500 5044
         DC    C'IHCADJST'               . 00003C C9C8C3C1C4D1E2E3
         SVC   9                              DELETE                   *
                                         . 000044 0A09
         L     1,3276(,6)                . 000046 5810 6CCC
         LTR   1,1                       . 00004A 1211
         BZ    86(,5)                    . 00004C 4780 5056
         SVC   14                             SPIE                     *
                                         . 000050 0A0E
         B     100(,5)                   . 000052 47F0 5064
         LA    1,98(,5)                  . 000056 4110 5062
         BALR  1,1                            CALL                     *
                                         . 00005A 0511
         DC    X'000000000000'           . 00005C 000000000000
         SVC   14                             SPIE                     *
                                         . 000062 0A0E
         L     13,3452(,6)               . 000064 58D0 6D7C
         L     14,12(,13)                . 000068 58E0 D00C
         LR    15,4                      . 00006C 18F4
         LM    0,12,20(13)               . 00006E 980C D014
         BR    14                        . 000072 07FE
         LR    2,15                      . 000074 182F
         L     4,16(13)                  . 000076 584D 0010
         ST    4,192(,2)                 . 00007A 5040 20C0
         L     4,3268(,2)                . 00007E 5840 2CC4
         L     3,3240(,2)                . 000082 5830 2CA8
         TM    4(4),X'40'                . 000086 9140 4004
         BZ    170(,5)                   . 00008A 4780 50AA
         LA    1,154(,5)                 . 00008E 4110 509A
         BALR  1,1                            CALL                     *
                                         . 000092 0511
         DC    X'02000000025D'           . 000094 02000000025D
         ST    3,0(,1)                   . 00009A 5030 1000
         MVI   0(1),X'02'                . 00009E 9202 1000
         SVC   14                             SPIE                     *
                                         . 0000A2 0A0E
         B     192(,5)                   . 0000A4 47F0 50C0
         NOPR  0                         . 0000A8 0700
         LA    1,182(,5)                 . 0000AA 4110 50B6
         BALR  1,1                            CALL                     *
                                         . 0000AE 0511
         DC    X'02000000005D'           . 0000B0 02000000005D
         ST    3,0(,1)                   . 0000B6 5030 1000
         MVI   0(1),X'02'                . 0000BA 9202 1000
         SVC   14                             SPIE                     *
                                         . 0000BE 0A0E
         ST    1,3276(,2)                . 0000C0 5010 2CCC
         MVI   124(2),X'FF'              . 0000C4 92FF 207C
         LM    14,5,124(2)               . 0000C8 98E5 207C
         BR    14                        . 0000CC 07FE
SEQDASD  LA    1,231                     . 0000CE 4110 00E7
         B     550(,15)                  . 0000D2 47F0 F226
         BC    2,1301(14,1)              . 0000D6 472E 1515
         CLR   1,5                       . 0000DA 1515
         CLR   1,5                       . 0000DC 1515
         CLR   1,5                       . 0000DE 1515
         CLR   1,5                       . 0000E0 1515
         CLR   1,5                       . 0000E2 1515
         CLR   1,5                       . 0000E4 1515
         CLR   1,5                       . 0000E6 1515
         CLR   1,5                       . 0000E8 1515
         CLR   1,5                       . 0000EA 1515
         CLR   1,5                       . 0000EC 1515
         CLR   1,5                       . 0000EE 1515
         CLR   1,5                       . 0000F0 1515
         CLR   1,5                       . 0000F2 1515
         CLR   1,5                       . 0000F4 1515
         CLR   1,5                       . 0000F6 1515
         CLR   1,5                       . 0000F8 1515
         CLR   1,5                       . 0000FA 1515
         CLR   1,5                       . 0000FC 1515
         CLR   1,5                       . 0000FE 1515
         CLR   1,5                       . 000100 1515
         CLR   1,5                       . 000102 1515
         CLR   1,5                       . 000104 1515
         CLR   1,5                       . 000106 1515
         CLR   1,5                       . 000108 1515
         CLR   1,5                       . 00010A 1515
         CLR   1,5                       . 00010C 1515
         CLR   1,5                       . 00010E 1515
         CLR   1,5                       . 000110 1515
         CLR   1,5                       . 000112 1515
         CLR   1,5                       . 000114 1515
         DC    X'15150015'               . 000116 15150015
         CLR   1,5                       . 00011A 1515
         CLR   1,5                       . 00011C 1515
         CLR   1,5                       . 00011E 1515
         CLR   1,1                       . 000120 1511
         CLR   1,1                       . 000122 1511
         NR    0,2                       . 000124 1402
         CLR   1,5                       . 000126 1515
         CLR   1,5                       . 000128 1515
         CLR   1,5                       . 00012A 1515
         CLR   1,5                       . 00012C 1515
         CLR   1,5                       . 00012E 1515
         CLR   1,5                       . 000130 1515
         CLR   1,5                       . 000132 1515
         CLR   1,4                       . 000134 1514
         CLR   1,5                       . 000136 1515
         BCR   1,3                       . 000138 0713
         CLR   1,5                       . 00013A 1515
         CLR   1,5                       . 00013C 1515
         CLR   1,5                       . 00013E 1515
         CLR   1,2                       . 000140 1512
         DC    X'15120215'               . 000142 15120215
         CLR   1,5                       . 000146 1515
         CLR   1,5                       . 000148 1515
         CLR   1,5                       . 00014A 1515
         CLR   1,5                       . 00014C 1515
         CLR   1,5                       . 00014E 1515
         CLR   1,5                       . 000150 1515
         CLR   1,5                       . 000152 1515
         LPR   1,0                       . 000154 1010
         CLR   1,5                       . 000156 1515
         CLR   1,5                       . 000158 1515
         CLR   1,5                       . 00015A 1515
         CLR   1,5                       . 00015C 1515
         CLR   1,5                       . 00015E 1515
         CLR   1,5                       . 000160 1515
         CLR   1,5                       . 000162 1515
         CLR   1,5                       . 000164 1515
         CLR   1,5                       . 000166 1515
         CLR   1,5                       . 000168 1515
         CLR   1,5                       . 00016A 1515
         CLR   1,5                       . 00016C 1515
         CLR   1,5                       . 00016E 1515
         CLR   1,5                       . 000170 1515
         CLR   1,5                       . 000172 1515
         CLR   1,5                       . 000174 1515
         CLR   1,5                       . 000176 1515
         CLR   1,5                       . 000178 1515
         CLR   1,5                       . 00017A 1515
         CLR   1,5                       . 00017C 1515
         CLR   1,5                       . 00017E 1515
         CLR   1,5                       . 000180 1515
         CLR   1,5                       . 000182 1515
         CLR   1,5                       . 000184 1515
         CLR   1,5                       . 000186 1515
         CLR   1,5                       . 000188 1515
         CLR   1,5                       . 00018A 1515
         CLR   1,5                       . 00018C 1515
         CLR   1,5                       . 00018E 1515
         CLR   1,5                       . 000190 1515
         CLR   1,5                       . 000192 1515
         CLR   1,5                       . 000194 1515
         CLR   1,5                       . 000196 1515
         CLR   0,3                       . 000198 1503
         DC    X'15150B0A'               . 00019A 15150B0A
         ISK   0,12                      . 00019E 090C
         CLCL  0,6                       . 0001A0 0F06
         CLR   1,5                       . 0001A2 1515
         CLR   1,5                       . 0001A4 1515
         CLR   1,5                       . 0001A6 1515
         CLR   1,5                       . 0001A8 1515
         CLR   0,4                       . 0001AA 1504
         CLR   1,5                       . 0001AC 1515
         CLR   0,8                       . 0001AE 1508
         CLR   1,5                       . 0001B0 1515
         CLR   1,5                       . 0001B2 1515
         CLR   1,5                       . 0001B4 1515
         CLR   1,5                       . 0001B6 1515
         CLR   1,5                       . 0001B8 1515
         CLR   0,13                      . 0001BA 150D
         CLR   1,5                       . 0001BC 1515
         CLR   0,14                      . 0001BE 150E
         CLR   0,5                       . 0001C0 1505
         CLR   1,5                       . 0001C2 1515
         CLR   1,5                       . 0001C4 1515
         DC    X'1515010101010101'       . 0001C6 1515010101010101
         DC    X'01010101'               . 0001CE 01010101
         CLR   1,5                       . 0001D2 1515
         CLR   1,5                       . 0001D4 1515
         DC    X'1515'                   . 0001D6 1515
         END   IHCCOMH2                  .
