IHCFIOSH TITLE 'SPTS disassembly of IHCFIOSH  8/06/24'
IHCFIOSH CSECT                           . 000000
         ENTRY FIOCS#                    .
         USING IHCFIOSH,1                .
FIOCS#   BOR   0                         . 000000 0710
         ST    13,DATA0080               . 000002 50D0 1080
         STM   14,12,DATA0088            . 000006 90EC 1088
         LM    11,13,DATA0144            . 00000A 98BD 1144
         DROP  1                         .
         USING IHCFIOSH,12               .
         LR    4,0                       . 00000E 1840
         MVC   DATA0058(1),0(4)          . 000010 D200 C058 4000
         SR    10,10                     . 000016 1BAA
         IC    10,0(4)                   . 000018 43A4 0000
         SLA   10,2                      . 00001C 8BA0 0002
         B     IOS00024(10)              . 000020 47FA C024
IOS00024 B     IOS0019C                  . 000024 47F0 C19C
         B     IOS001E0                  . 000028 47F0 C1E0
         B     IOS003E4                  . 00002C 47F0 C3E4
         B     IOS00AB2                  . 000030 47F0 CAB2
         B     IOS00C04                  . 000034 47F0 CC04
DATA0038 DC    X'00000000'               . 000038 00000000
DATA003C DC    X'0000'                   . 00003C 0000
DATA003E DC    X'0000'                   . 00003E 0000
DATA0040 DC    X'0000000000'             . 000040 0000000000
DATA0045 DC    X'00'                     . 000045 00
DATA0046 DC    X'00'                     . 000046 00
DATA0047 DC    X'00'                     . 000047 00
DATA0048 DC    X'715B'                   . 000048 715B
         LPDR  0,0                       . 00004A 2000
DATA004C DC    X'94'                     . 00004C 94
DATA004D DC    X'0F'                     . 00004D 0F
DATA004E DC    X'0011'                   . 00004E 0011
DATA0050 DC    X'00040010'               . 000050 00040010
DATA0054 DC    X'00000100'               . 000054 00000100
DATA0058 DC    X'00'                     . 000058 00
DATA0059 DC    X'00'                     . 000059 00
DATA005A DC    X'00'                     . 00005A 00
DATA005B DC    X'0808'                   . 00005B 0808
DATA005D DC    X'00'                     . 00005D 00
DATA005E DC    X'0000'                   . 00005E 0000
DATA0060 DC    X'00000000'               . 000060 00000000
DATA0064 DC    X'0000000000000000'       . 000064 0000000000000000
         DC    X'0000000000000001'       . 00006C 0000000000000001
         DC    X'07F8000000000000'       . 000074 07F8000000000000
DATA007C DC    X'00000000'               . 00007C 00000000
DATA0080 DC    X'00000000'               . 000080 00000000
         DC    A(DATA00E8)               . 000084 000000E8
DATA0088 DC    XL60'0'                   . 000088 0000000000000000
DATA00C4 DC    XL36'0'                   . 0000C4 0000000000000000
DATA00E8 DC    X'00000000'               . 0000E8 00000000
         DC    A(DATA007C)               . 0000EC 0000007C
         DC    XL64'0'                   . 0000F0 0000000000000000
DATA0130 DC    V(IHCERRM)                . 000130 00000000
DATA0134 DC    X'0000000000000000'       . 000134 0000000000000000
         DC    X'80'                     . 00013C 80
         DC    AL3(DATA0140)             . 00013D 000140
DATA0140 DC    X'00000000'               . 000140 00000000
DATA0144 DC    V(IHCUATBL)               . 000144 00000000
         DC    A(FIOCS#)                 . 000148 00000000
         DC    A(DATA00E8)               . 00014C 000000E8
DATA0150 DC    V(IBCOM#)                 . 000150 00000000
DATA0154 DC    X'0000000000000001'       . 000154 0000000000000001
         DC    X'0000400000000001'       . 00015C 0000400000000001
         DC    X'00'                     . 000164 00
         DC    AL3(IOS00DB0)             . 000165 000DB0
         DC    X'00'                     . 000168 00
         DC    AL3(DATA0D50)             . 000169 000D50
         DC    C'FTXXF'                  . 00016C C6E3E7E7C6
DATA0171 DC    C'001'                    . 000171 F0F0F1
         DC    X'0200202000000001'       . 000174 0200202000000001
         DC    A(IOS00D58)               . 00017C 00000D58
         DC    X'0000000000000000'       . 000180 0000000000000000
         DC    X'0000000100000001'       . 000188 0000000100000001
         DC    X'0000000100000000'       . 000190 0000000100000000
         DC    X'00000001'               . 000198 00000001
IOS0019C BAL   10,IOS00562                    CALL                     *
                                         . 00019C 45A0 C562
         B     IOS001CC                  . 0001A0 47F0 C1CC
         LA    1,231                     . 0001A4 4110 00E7
IOS001A8 ST    1,DATA0140                . 0001A8 5010 C140
         LA    1,DATA0134                . 0001AC 4110 C134
         L     15,DATA0150               . 0001B0 58F0 C150
         L     13,184(,15)               . 0001B4 58D0 F0B8
         MVC   12(16,13),124(15)         . 0001B8 D20F D00C F07C
         ST    13,200(,15)               . 0001BE 50D0 F0C8
         LA    13,196(,15)               . 0001C2 41D0 F0C4
         L     15,DATA0130               . 0001C6 58F0 C130
         BR    15                        . 0001CA 07FF
IOS001CC TM    2(6),X'10'                . 0001CC 9110 6002
         BO    IOS001D8                  . 0001D0 4710 C1D8
         BAL   10,IOS00BC8                    CALL                     *
                                         . 0001D4 45A0 CBC8
IOS001D8 TM    DATA005D,X'0F'            . 0001D8 910F C05D
         BO    IOS00380                  . 0001DC 4710 C380
IOS001E0 LM    6,8,DATA0064              . 0001E0 9868 C064
         TM    2(6),X'04'                . 0001E4 9104 6002
         BO    IOS001FC                  . 0001E8 4710 C1FC
         TM    2(6),X'10'                . 0001EC 9110 6002
         BO    IOS00A24                  . 0001F0 4710 CA24
         BAL   10,IOS00BC8                    CALL                     *
                                         . 0001F4 45A0 CBC8
         B     IOS00A02                  . 0001F8 47F0 CA02
IOS001FC TM    1(6),X'08'                . 0001FC 9108 6001
         BO    IOS00246                  . 000200 4710 C246
IOS00204 BAL   9,IOS00342                     CALL                     *
                                         . 000204 4590 C342
         LA    2,0(4,5)                  . 000208 4124 5000
         TM    36(7),X'40'               . 00020C 9140 7024
         BO    IOS0022E                  . 000210 4710 C22E
         LH    3,82(,7)                  . 000214 4830 7052
         AR    5,3                       . 000218 1A53
IOS0021A ST    5,16(,6)                  . 00021A 5050 6010
         CH    5,6(,8)                   . 00021E 4950 8006
         BL    IOS0022A                  . 000222 4740 C22A
         OI    1(6),X'08'                . 000226 9608 6001
IOS0022A B     IOS00D38                  . 00022A 47F0 CD38
IOS0022E MVC   DATA0048(2),0(2)          . 00022E D201 C048 2000
         LH    3,DATA0048                . 000234 4830 C048
         AR    5,3                       . 000238 1A53
         SH    3,DATA0050                . 00023A 4B30 C050
         AH    2,DATA0050                . 00023E 4A20 C050
         B     IOS0021A                  . 000242 47F0 C21A
IOS00246 CLI   20(7),X'01'               . 000246 9501 7014
         BNE   IOS0025A                  . 00024A 4770 C25A
         TM    1(6),X'10'                . 00024E 9110 6001
         BO    IOS0025A                  . 000252 4710 C25A
IOS00256 BAL   10,IOS00306                    CALL                     *
                                         . 000256 45A0 C306
IOS0025A BAL   10,IOS002AA                    CALL                     *
                                         . 00025A 45A0 C2AA
         B     IOS00D30                  . 00025E 47F0 CD30
         L     2,12(,8)                  . 000262 5820 800C
         TM    1(6),X'02'                . 000266 9102 6001
         BO    IOS002A2                  . 00026A 4710 C2A2
         LH    3,62(,7)                  . 00026E 4830 703E
         L     5,16(,8)                  . 000272 5850 8010
         SH    3,14(5)                   . 000276 4B35 000E
IOS0027A TM    2(6),X'04'                . 00027A 9104 6002
         BZ    IOS00292                  . 00027E 4780 C292
         CLI   20(7),X'01'               . 000282 9501 7014
         BE    IOS00292                  . 000286 4780 C292
         BAL   10,IOS002E8                    CALL                     *
                                         . 00028A 45A0 C2E8
         BAL   10,IOS00306                    CALL                     *
                                         . 00028E 45A0 C306
IOS00292 TM    1(6),X'06'                . 000292 9106 6001
         BZ    IOS00D38                  . 000296 4780 CD38
         STH   3,6(,8)                   . 00029A 4030 8006
         B     IOS00204                  . 00029E 47F0 C204
IOS002A2 LH    3,0(,2)                   . 0002A2 4830 2000
         B     IOS0027A                  . 0002A6 47F0 C27A
IOS002AA OI    1(6),X'80'                . 0002AA 9680 6001
IOS002AE NI    1(6),X'EF'                . 0002AE 94EF 6001
         CLI   3(6),X'00'                . 0002B2 9500 6003
         BE    4(,10)                    . 0002B6 4780 A004
         MVI   3(6),X'00'                . 0002BA 9200 6003
         LR    1,8                       . 0002BE 1818
         L     14,8(,1)                  . 0002C0 58E0 1008
         L     15,52(,14)                . 0002C4 58F0 E034
         BALR  14,15                          CALL                     *
                                         . 0002C8 05EF
         TM    2(6),X'02'                . 0002CA 9102 6002
         BO    IOS00A02                  . 0002CE 4710 CA02
         MVC   DATA005A(1),1(6)          . 0002D2 D200 C05A 6001
         NI    1(6),X'3F'                . 0002D8 943F 6001
         TM    DATA005A,X'C0'            . 0002DC 91C0 C05A
         BO    IOS00D28                  . 0002E0 4710 CD28
         B     4(10)                     . 0002E4 47FA 0004
IOS002E8 BAL   4,IOS002F6                     CALL                     *
                                         . 0002E8 4540 C2F6
         ST    5,12(,8)                  . 0002EC 5050 800C
         XI    1(6),X'20'                . 0002F0 9720 6001
         BR    10                        . 0002F4 07FA
IOS002F6 L     5,8(,6)                   . 0002F6 5850 6008
         TM    1(6),X'20'                . 0002FA 9120 6001
         BOR   4                         . 0002FE 0714
         L     5,4(,6)                   . 000300 5850 6004
         BR    4                         . 000304 07F4
IOS00306 MVI   3(6),X'01'                . 000306 9201 6003
         MVI   4(8),X'80'                . 00030A 9280 8004
         LR    1,8                       . 00030E 1818
         MVI   5(1),X'80'                . 000310 9280 1005
         ST    7,8(1)                    . 000314 5071 0008
         L     15,8(1)                   . 000318 58F1 0008
         L     15,48(,15)                . 00031C 58F0 F030
         BALR  14,15                          CALL                     *
                                         . 000320 05EF
         BR    10                        . 000322 07FA
IOS00324 MVI   3(6),X'01'                . 000324 9201 6003
         MVI   4(8),X'00'                . 000328 9200 8004
         LR    1,8                       . 00032C 1818
         MVI   5(1),X'20'                . 00032E 9220 1005
         ST    7,8(1)                    . 000332 5071 0008
         L     15,8(1)                   . 000336 58F1 0008
         L     15,48(,15)                . 00033A 58F0 F030
         BALR  14,15                          CALL                     *
                                         . 00033E 05EF
         BR    10                        . 000340 07FA
IOS00342 TM    1(6),X'08'                . 000342 9108 6001
         BZ    IOS0037A                  . 000346 4780 C37A
         L     2,4(,6)                   . 00034A 5820 6004
         TM    2(6),X'04'                . 00034E 9104 6002
         BZ    IOS00364                  . 000352 4780 C364
         CLI   20(7),X'01'               . 000356 9501 7014
         BE    IOS00364                  . 00035A 4780 C364
         BAL   4,IOS002F6                     CALL                     *
                                         . 00035E 4540 C2F6
         LR    2,5                       . 000362 1825
IOS00364 SR    3,3                       . 000364 1B33
         TM    36(7),X'40'               . 000366 9140 7024
         BZ    IOS00372                  . 00036A 4780 C372
         LA    3,4                       . 00036E 4130 0004
IOS00372 STM   2,3,12(6)                 . 000372 9023 600C
         XI    1(6),X'08'                . 000376 9708 6001
IOS0037A LM    4,5,12(6)                 . 00037A 9845 600C
         BR    9                         . 00037E 07F9
IOS00380 TM    0(6),X'0F'                . 000380 910F 6000
         BO    IOS003A8                  . 000384 4710 C3A8
         CLI   20(7),X'01'               . 000388 9501 7014
         BE    IOS00A24                  . 00038C 4780 CA24
         BAL   10,IOS002AE                    CALL                     *
                                         . 000390 45A0 C2AE
         B     IOS003A0                  . 000394 47F0 C3A0
         BAL   10,IOS00B14                    CALL                     *
                                         . 000398 45A0 CB14
         B     IOS00A24                  . 00039C 47F0 CA24
IOS003A0 BAL   10,IOS00BC8                    CALL                     *
                                         . 0003A0 45A0 CBC8
         B     IOS00A02                  . 0003A4 47F0 CA02
IOS003A8 TM    1(6),X'08'                . 0003A8 9108 6001
         BO    IOS003D6                  . 0003AC 4710 C3D6
IOS003B0 BAL   9,IOS00342                     CALL                     *
                                         . 0003B0 4590 C342
         LH    3,82(,7)                  . 0003B4 4830 7052
         LA    2,0(4,5)                  . 0003B8 4124 5000
IOS003BC TM    36(7),X'40'               . 0003BC 9140 7024
         BZ    IOS00D38                  . 0003C0 4780 CD38
         SH    3,DATA0050                . 0003C4 4B30 C050
         MVC   2(2,2),DATA0060           . 0003C8 D201 2002 C060
         LA    2,4(,2)                   . 0003CE 4120 2004
         B     IOS00D38                  . 0003D2 47F0 CD38
IOS003D6 BAL   4,IOS002F6                     CALL                     *
                                         . 0003D6 4540 C2F6
         LR    2,5                       . 0003DA 1825
         LH    3,62(,7)                  . 0003DC 4830 703E
         B     IOS00D38                  . 0003E0 47F0 CD38
IOS003E4 STH   2,DATA004C                . 0003E4 4020 C04C
         LM    6,8,DATA0064              . 0003E8 9868 C064
         TM    1(6),X'06'                . 0003EC 9106 6001
         BZ    IOS00452                  . 0003F0 4780 C452
         LM    4,5,12(6)                 . 0003F4 9845 600C
         LH    3,82(,7)                  . 0003F8 4830 7052
         TM    36(7),X'40'               . 0003FC 9140 7024
         BO    IOS0040E                  . 000400 4710 C40E
         AR    5,3                       . 000404 1A53
         LA    2,0(4,5)                  . 000406 4124 5000
         B     IOS00426                  . 00040A 47F0 C426
IOS0040E LA    2,4(2)                    . 00040E 4122 0004
         LA    10,0(4,5)                 . 000412 41A4 5000
         STH   2,DATA0048                . 000416 4020 C048
         MVC   0(2,10),DATA0048          . 00041A D201 A000 C048
         AR    5,2                       . 000420 1A52
         LA    2,0(4,5)                  . 000422 4124 5000
IOS00426 ST    5,16(,6)                  . 000426 5050 6010
         AH    5,82(,7)                  . 00042A 4A50 7052
         TM    1(6),X'04'                . 00042E 9104 6001
         BZ    IOS0043E                  . 000432 4780 C43E
         CH    5,62(,7)                  . 000436 4950 703E
         BNH   IOS003BC                  . 00043A 47D0 C3BC
IOS0043E TM    36(7),X'40'               . 00043E 9140 7024
         BZ    IOS0044E                  . 000442 4780 C44E
         L     5,16(,6)                  . 000446 5850 6010
         STH   5,0(4)                    . 00044A 4054 0000
IOS0044E OI    1(6),X'08'                . 00044E 9608 6001
IOS00452 MVC   DATA0048(4),12(8)         . 000452 D203 C048 800C
         CLI   20(7),X'01'               . 000458 9501 7014
         BE    IOS004DA                  . 00045C 4780 C4DA
         BAL   10,IOS002AA                    CALL                     *
                                         . 000460 45A0 C2AA
         NOP   0                         . 000464 4700 0000
         TM    2(6),X'01'                . 000468 9101 6002
         BO    IOS004D6                  . 00046C 4710 C4D6
         L     4,44(7)                   . 000470 5847 002C
         L     4,32(4)                   . 000474 5844 0020
         CLC   4(2,4),DATA086C           . 000478 D501 4004 C86C
         BNE   IOS004D6                  . 00047E 4770 C4D6
         BAL   4,IOS002F6                     CALL                     *
                                         . 000482 4540 C2F6
         LA    4,17                      . 000486 4140 0011
         LA    10,IOS00908               . 00048A 41A0 C908
IOS0048E CLC   0(1,10),0(5)              . 00048E D500 A000 5000
         BE    IOS004A4                  . 000494 4780 C4A4
         LA    10,2(10)                  . 000498 41AA 0002
         BCT   4,IOS0048E                     LOOP                     *
                                         . 00049C 4640 C48E
         LA    10,IOS00908               . 0004A0 41A0 C908
IOS004A4 L     4,DATA0864                . 0004A4 5840 C864
         MVC   0(1,4),1(10)              . 0004A8 D200 4000 A001
         MVC   8(4,6),4(6)               . 0004AE D203 6008 6004
         MVC   4(4,6),12(8)              . 0004B4 D203 6004 800C
         ST    4,12(,8)                  . 0004BA 5040 800C
         MVC   DATA0864(4),8(6)          . 0004BE D203 C864 6008
         LH    4,DATA086E                . 0004C4 4840 C86E
         MVC   DATA086E(2),DATA004C      . 0004C8 D201 C86E C04C
         STH   4,DATA004C                . 0004CE 4040 C04C
         B     IOS004DA                  . 0004D2 47F0 C4DA
IOS004D6 BAL   10,IOS002E8                    CALL                     *
                                         . 0004D6 45A0 C2E8
IOS004DA CLC   DATA004C(2),DATA004E      . 0004DA D501 C04C C04E
         BH    IOS004E8                  . 0004E0 4720 C4E8
         MVI   DATA004D,X'12'            . 0004E4 9212 C04D
IOS004E8 MVC   6(2,8),DATA004C           . 0004E8 D201 8006 C04C
         BAL   10,IOS00324                    CALL                     *
                                         . 0004EE 45A0 C324
         CLI   DATA0058,X'04'            . 0004F2 9504 C058
         BE    IOS00C54                  . 0004F6 4780 CC54
         CLI   20(7),X'01'               . 0004FA 9501 7014
         BNE   IOS0050A                  . 0004FE 4770 C50A
         BAL   10,IOS002AA                    CALL                     *
                                         . 000502 45A0 C2AA
         NOP   0                         . 000506 4700 0000
IOS0050A BAL   4,IOS0051A                     CALL                     *
                                         . 00050A 4540 C51A
         TM    1(6),X'06'                . 00050E 9106 6001
         BZ    IOS00D38                  . 000512 4780 CD38
         B     IOS003B0                  . 000516 47F0 C3B0
IOS0051A TM    DATA005D,X'F0'            . 00051A 91F0 C05D
         BZR   4                         . 00051E 0784
         L     9,DATA0048                . 000520 5890 C048
         MVI   0(9),X'40'                . 000524 9240 9000
         LH    3,62(,7)                  . 000528 4830 703E
         BCTR  3,0                            DECREMENT                *
                                         . 00052C 0630
         BCTR  3,0                            DECREMENT                *
                                         . 00052E 0630
         EX    3,IOS0055C                . 000530 4430 C55C
         SR    2,2                       . 000534 1B22
         D     2,DATA0054                . 000536 5D20 C054
         LTR   3,3                       . 00053A 1233
         BZ    IOS00552                  . 00053C 4780 C552
         LA    9,1(2,9)                  . 000540 4192 9001
IOS00544 MVC   1(256,9),0(9)             . 000544 D2FF 9001 9000
         LA    9,256(9)                  . 00054A 4199 0100
         BCT   3,IOS00544                     LOOP                     *
                                         . 00054E 4630 C544
IOS00552 L     2,DATA0048                . 000552 5820 C048
         LH    3,62(,7)                  . 000556 4830 703E
         BR    4                         . 00055A 07F4
IOS0055C MVC   1(1,9),0(9)               . 00055C D200 9001 9000
IOS00562 MVC   DATA005D(1),1(4)          . 000562 D200 C05D 4001
         MVC   DATA0059(1),0(2)          . 000568 D200 C059 2000
         TM    DATA0059,X'01'            . 00056E 9101 C059
         BZ    IOS0057A                  . 000572 4780 C57A
         L     2,0(2)                    . 000576 5822 0000
IOS0057A L     2,0(2)                    . 00057A 5822 0000
         TM    DATA0059,X'04'            . 00057E 9104 C059
         BZ    IOS0058A                  . 000582 4780 C58A
         IC    2,4(2,11)                 . 000586 4322 B004
IOS0058A LA    5,0(2)                    . 00058A 4152 0000
         STH   2,0(,11)                  . 00058E 4020 B000
         LTR   2,5                       . 000592 1225
         BNP   IOS005A6                  . 000594 47D0 C5A6
         BCTR  2,0                            DECREMENT                *
                                         . 000598 0620
         SLA   2,4                       . 00059A 8B20 0004
         CH    2,2(,11)                  . 00059E 4920 B002
         BL    IOS005AE                  . 0005A2 4740 C5AE
IOS005A6 LA    1,220                     . 0005A6 4110 00DC
         B     IOS001A8                  . 0005AA 47F0 C1A8
IOS005AE LA    2,8(2,11)                 . 0005AE 4122 B008
         TM    15(2),X'01'               . 0005B2 9101 200F
         BO    IOS005BE                  . 0005B6 4710 C5BE
         B     4(10)                     . 0005BA 47FA 0004
IOS005BE TM    3(2),X'01'                . 0005BE 9101 2003
         BZ    IOS00654                  . 0005C2 4780 C654
         TM    DATA086B,X'01'            . 0005C6 9101 C86B
         BO    IOS0062C                  . 0005CA 4710 C62C
         BAL   9,IOS0072A                     CALL                     *
                                         . 0005CE 4590 C72A
         MVC   DATA0872(2),DATA0046      . 0005D2 D201 C872 C046
         L     9,DATA0860                . 0005D8 5890 C860
         LA    9,20(9)                   . 0005DC 4199 0014
         SR    6,6                       . 0005E0 1B66
IOS005E2 CLC   8(8,9),DATA0870           . 0005E2 D507 9008 C870
         BE    IOS00600                  . 0005E8 4780 C600
         IC    6,4(9)                    . 0005EC 4369 0004
         AR    9,6                       . 0005F0 1A96
         CLC   4(4,9),DATA0060           . 0005F2 D503 9004 C060
         BE    IOS0062C                  . 0005F8 4780 C62C
         B     IOS005E2                  . 0005FC 47F0 C5E2
IOS00600 L     6,20(9)                   . 000600 5869 0014
         TM    2(6),X'FF'                . 000604 91FF 6002
         BC    12,IOS0062C               . 000608 47C0 C62C
         LA    6,0(,6)                   . 00060C 4160 6000
         LTR   6,6                       . 000610 1266
         BZ    IOS0062C                  . 000612 4780 C62C
         CLC   4(2,6),DATA086C           . 000616 D501 6004 C86C
         BNE   IOS0062C                  . 00061C 4770 C62C
         L     1,DATA0868                . 000620 5810 C868
         ST    1,0(2)                    . 000624 5012 0000
         B     IOS00654                  . 000628 47F0 C654
IOS0062C LA    0,128                     . 00062C 4100 0080
         BAL   1,IOS00634                     PLIST                    *
                                         . 000630 4510 C634
IOS00634 SVC   10                             GETMAIN/FREEMAIN         *
                                         . 000634 0A0A
         ST    1,0(2)                    . 000636 5012 0000
         LR    6,1                       . 00063A 1861
         MVI   0(6),X'00'                . 00063C 9200 6000
         MVC   1(56,6),0(6)              . 000640 D237 6001 6000
         MVC   56(72,6),DATA0154         . 000646 D247 6038 C154
         LA    7,40(,6)                  . 00064C 4170 6028
         ST    7,28(,6)                  . 000650 5070 601C
IOS00654 L     6,0(2)                    . 000654 5862 0000
         L     7,28(,6)                  . 000658 5870 601C
         LA    8,20(,6)                  . 00065C 4180 6014
         STM   6,8,DATA0064              . 000660 9068 C064
         TM    2(6),X'C4'                . 000664 91C4 6002
         BO    IOS0073A                  . 000668 4710 C73A
         TM    2(6),X'08'                . 00066C 9108 6002
         BO    IOS00684                  . 000670 4710 C684
         TM    DATA0058,X'03'            . 000674 9103 C058
         BZ    IOS00684                  . 000678 4780 C684
         TM    DATA005D,X'02'            . 00067C 9102 C05D
         BZ    IOS00ABA                  . 000680 4780 CABA
IOS00684 TM    2(6),X'20'                . 000684 9120 6002
         BO    IOS0069A                  . 000688 4710 C69A
         BAL   9,IOS0072A                     CALL                     *
                                         . 00068C 4590 C72A
         MVC   42(2,7),DATA0046          . 000690 D201 702A C046
         B     IOS0073C                  . 000696 47F0 C73C
IOS0069A TM    2(6),X'08'                . 00069A 9108 6002
         BZ    IOS006F6                  . 00069E 4780 C6F6
         TM    2(6),X'04'                . 0006A2 9104 6002
         BZ    IOS00700                  . 0006A6 4780 C700
         OI    2(6),X'40'                . 0006AA 9640 6002
         CLI   DATA0058,X'03'            . 0006AE 9503 C058
         BNE   IOS006C2                  . 0006B2 4770 C6C2
         CLI   DATA005D,X'01'            . 0006B6 9501 C05D
         BL    IOS00B0C                  . 0006BA 4740 CB0C
         BE    IOS0073A                  . 0006BE 4780 C73A
IOS006C2 NOPR  0                         . 0006C2 0700
         BAL   1,IOS006CC                     PLIST                    *
                                         . 0006C4 4510 C6CC
         DC    X'00000000'               . 0006C8 00000000
IOS006CC ST    7,0(1)                    . 0006CC 5071 0000
         MVI   0(1),X'B0'                . 0006D0 92B0 1000
         SVC   20                             CLOSE                    *
                                         . 0006D4 0A14
         NI    2(6),X'3F'                . 0006D6 943F 6002
         PACK  DATA003E(2),45(3,7)       . 0006DA F212 C03E 702D
         CVB   5,DATA0038                . 0006E0 4F50 C038
         LA    5,1(5)                    . 0006E4 4155 0001
         BAL   9,IOS0072A                     CALL                     *
                                         . 0006E8 4590 C72A
         MVC   45(3,7),DATA0045          . 0006EC D202 702D C045
         B     IOS0073C                  . 0006F2 47F0 C73C
IOS006F6 MVC   45(3,7),DATA0171          . 0006F6 D202 702D C171
         B     IOS0073C                  . 0006FC 47F0 C73C
IOS00700 TM    DATA0058,X'03'            . 000700 9103 C058
         BO    IOS0073A                  . 000704 4710 C73A
         OI    2(6),X'04'                . 000708 9604 6002
         TM    2(6),X'10'                . 00070C 9110 6002
         BO    IOS0071C                  . 000710 4710 C71C
         BAL   10,IOS00BC8                    CALL                     *
                                         . 000714 45A0 CBC8
         B     IOS00A02                  . 000718 47F0 CA02
IOS0071C CLC   DATA005D(1),0(6)          . 00071C D500 C05D 6000
         BE    IOS00A4E                  . 000722 4780 CA4E
         B     IOS00A24                  . 000726 47F0 CA24
IOS0072A CVD   5,DATA0038                . 00072A 4E50 C038
         UNPK  DATA0040(8),DATA003C(4)   . 00072E F373 C040 C03C
         OI    DATA0047,X'F0'            . 000734 96F0 C047
         BR    9                         . 000738 07F9
IOS0073A BR    10                        . 00073A 07FA
IOS0073C MVI   DATA005E,X'00'            . 00073C 9200 C05E
         TM    DATA086B,X'01'            . 000740 9101 C86B
         BZ    IOS007EE                  . 000744 4780 C7EE
         BAL   1,IOS00758                     PLIST                    *
                                         . 000748 4510 C758
         DC    A(DATA0860)               . 00074C 00000860
         DC    X'0000000002000000'       . 000750 0000000002000000
IOS00758 SVC   40                             EXTRACT                  *
                                         . 000758 0A28
         L     10,DATA0860               . 00075A 58A0 C860
IOS0075E CLC   24(4,10),DATA0060         . 00075E D503 A018 C060
         BE    IOS00842                  . 000764 4780 C842
         CLC   40(8,7),28(10)            . 000768 D507 7028 A01C
         BE    IOS0077E                  . 00076E 4780 C77E
         SR    1,1                       . 000772 1B11
         IC    1,24(10)                  . 000774 431A 0018
         AR    10,1                      . 000778 1AA1
         B     IOS0075E                  . 00077A 47F0 C75E
IOS0077E L     10,40(,10)                . 00077E 58A0 A028
         TM    2(10),X'FF'               . 000782 91FF A002
         BC    12,IOS007EE               . 000786 47C0 C7EE
         CLC   18(2,10),DATA005B         . 00078A D501 A012 C05B
         BNE   IOS007EE                  . 000790 4770 C7EE
         MVC   DATA086C(2),4(10)         . 000794 D201 C86C A004
         LA    0,176                     . 00079A 4100 00B0
         BAL   1,IOS007A2                     PLIST                    *
                                         . 00079E 4510 C7A2
IOS007A2 SVC   10                             GETMAIN/FREEMAIN         *
                                         . 0007A2 0A0A
         ST    1,IOS00D54                . 0007A4 5010 CD54
         MVI   IOS00D54,X'87'            . 0007A8 9287 CD54
         MVI   DATA0D50,X'05'            . 0007AC 9205 CD50
         LR    3,1                       . 0007B0 1831
         NOPR  0                         . 0007B2 0700
         BAL   1,IOS007BC                     PLIST                    *
                                         . 0007B4 4510 C7BC
         DC    X'00000000'               . 0007B8 00000000
IOS007BC ST    7,0(1)                    . 0007BC 5071 0000
         MVI   0(1),X'80'                . 0007C0 9280 1000
         SVC   64                             RDJFCB                   *
                                         . 0007C4 0A40
         OI    52(3),X'02'               . 0007C6 9602 3034
         NOPR  0                         . 0007CA 0700
         BAL   1,IOS007D4                     PLIST                    *
                                         . 0007CC 4510 C7D4
         DC    X'00000000'               . 0007D0 00000000
IOS007D4 ST    7,0(1)                    . 0007D4 5071 0000
         MVI   0(1),X'87'                . 0007D8 9287 1000
         SVC   22                             OPEN (TYPE=J)            *
                                         . 0007DC 0A16
         LA    0,176                     . 0007DE 4100 00B0
         LR    1,3                       . 0007E2 1813
         SVC   10                             GETMAIN/FREEMAIN         *
                                         . 0007E4 0A0A
         MVI   DATA0D50,X'85'            . 0007E6 9285 CD50
         B     IOS0082A                  . 0007EA 47F0 C82A
IOS007EE TM    DATA0058,X'03'            . 0007EE 9103 C058
         BO    IOS00818                  . 0007F2 4710 C818
         TM    DATA005D,X'0F'            . 0007F6 910F C05D
         BO    IOS00818                  . 0007FA 4710 C818
         NOPR  0                         . 0007FE 0700
         BAL   1,IOS00808                     PLIST                    *
                                         . 000800 4510 C808
         DC    X'00000000'               . 000804 00000000
IOS00808 ST    7,0(1)                    . 000808 5071 0000
         MVI   0(1),X'83'                . 00080C 9283 1000
         SVC   19                             OPEN                     *
                                         . 000810 0A13
         B     IOS0082A                  . 000812 47F0 C82A
         NOPR  0                         . 000816 0700
IOS00818 BAL   1,IOS00820                     PLIST                    *
                                         . 000818 4510 C820
         DC    X'00000000'               . 00081C 00000000
IOS00820 ST    7,0(1)                    . 000820 5071 0000
         MVI   0(1),X'87'                . 000824 9287 1000
         SVC   19                             OPEN                     *
                                         . 000828 0A13
IOS0082A CLI   DATA005E,X'FF'            . 00082A 95FF C05E
         BNE   IOS0083A                  . 00082E 4770 C83A
         LA    1,214                     . 000832 4110 00D6
         B     IOS001A8                  . 000836 47F0 C1A8
IOS0083A TM    48(7),X'10'               . 00083A 9110 7030
         BO    IOS00A02                  . 00083E 4710 CA02
IOS00842 CLC   1(1,11),4(11)             . 000842 D500 B001 B004
         BNE   IOS00856                  . 000848 4770 C856
         L     15,DATA0150               . 00084C 58F0 C150
         BAL   14,68(,15)                     CALL                     *
                                         . 000850 45E0 F044
         DC    X'0010'                   . 000854 0010
IOS00856 LA    1,219                     . 000856 4110 00DB
         B     IOS001A8                  . 00085A 47F0 C1A8
         DC    X'0000'                   . 00085E 0000
DATA0860 DC    X'00000000'               . 000860 00000000
DATA0864 DC    A(DATA0878)               . 000864 00000878
DATA0868 DC    X'000000'                 . 000868 000000
DATA086B DC    X'01'                     . 00086B 01
DATA086C DC    X'0000'                   . 00086C 0000
DATA086E DC    X'0012'                   . 00086E 0012
DATA0870 DC    C'FT'                     . 000870 C6E3
DATA0872 DC    C'00F001'                 . 000872 F0F0C6F0F0F1
DATA0878 DC    C' '                      . 000878 40
DATA0879 DC    CL133' '                  . 000879 4040404040404040
         DC    CL10' '                   . 0008FE 4040404040404040
IOS00908 STH   0,393(9,15)               . 000908 4009 F189
         DC    X'4E0150016019F011'       . 00090C 4E0150016019F011
         DC    X'F291F399F4A1F5A9'       . 000914 F291F399F4A1F5A9
         DC    X'F6B1F7B9'               . 00091C F6B1F7B9
         DC    C'8A9IAJBRC'              . 000920 F8C1F9C9C1D1C2D9
         DC    X'E1'                     . 000929 E1
IOS0092A TM    DATA086B,X'01'            . 00092A 9101 C86B
         BZ    IOS00970                  . 00092E 4780 C970
         TM    36(7),X'FF'               . 000932 91FF 7024
         BZ    IOS00942                  . 000936 4780 C942
         TM    36(7),X'04'               . 00093A 9104 7024
         BZ    IOS00970                  . 00093E 4780 C970
IOS00942 CLC   DATA086C(2),DATA0060      . 000942 D501 C86C C060
         BE    IOS00970                  . 000948 4780 C970
         MVI   36(7),X'82'               . 00094C 9282 7024
         CLC   62(2,7),DATA0060          . 000950 D501 703E C060
         BNE   IOS00966                  . 000956 4770 C966
         LA    10,133                    . 00095A 41A0 0085
         STH   10,82(,7)                 . 00095E 40A0 7052
         STH   10,62(,7)                 . 000962 40A0 703E
IOS00966 MVI   20(7),X'02'               . 000966 9202 7014
         MVC   DATA0868(4),0(2)          . 00096A D203 C868 2000
IOS00970 TM    DATA005D,X'F0'            . 000970 91F0 C05D
         BO    IOS00994                  . 000974 4710 C994
         TM    DATA0058,X'03'            . 000978 9103 C058
         BO    IOS00994                  . 00097C 4710 C994
         TM    36(7),X'80'               . 000980 9180 7024
         BZ    IOS00990                  . 000984 4780 C990
         MVI   DATA005E,X'FF'            . 000988 92FF C05E
         B     IOS00994                  . 00098C 47F0 C994
IOS00990 OI    36(7),X'40'               . 000990 9640 7024
IOS00994 LA    2,4(,2)                   . 000994 4120 2004
         SR    9,9                       . 000998 1B99
         CH    9,62(,7)                  . 00099A 4990 703E
         BNE   IOS009A8                  . 00099E 4770 C9A8
         MVC   62(2,7),2(2)              . 0009A2 D201 703E 2002
IOS009A8 CLI   36(7),X'00'               . 0009A8 9500 7024
         BNE   IOS009B6                  . 0009AC 4770 C9B6
         MVC   36(1,7),4(2)              . 0009B0 D200 7024 2004
IOS009B6 CLI   20(7),X'00'               . 0009B6 9500 7014
         BNE   IOS009C4                  . 0009BA 4770 C9C4
         MVC   20(1,7),5(2)              . 0009BE D200 7014 2005
IOS009C4 CH    9,82(,7)                  . 0009C4 4990 7052
         BNE   IOS009D2                  . 0009C8 4770 C9D2
         MVC   82(2,7),6(2)              . 0009CC D201 7052 2006
IOS009D2 LH    10,62(,7)                 . 0009D2 48A0 703E
         TM    36(7),X'80'               . 0009D6 9180 7024
         BO    IOS009E2                  . 0009DA 4710 C9E2
         SH    10,DATA0050               . 0009DE 4BA0 C050
IOS009E2 CH    9,82(,7)                  . 0009E2 4990 7052
         BE    IOS009F2                  . 0009E6 4780 C9F2
         CH    10,82(,7)                 . 0009EA 49A0 7052
         BNL   IOS009F6                  . 0009EE 47B0 C9F6
IOS009F2 STH   10,82(,7)                 . 0009F2 40A0 7052
IOS009F6 TM    2(6),X'80'                . 0009F6 9180 6002
         BZR   14                        . 0009FA 078E
         OI    2(6),X'02'                . 0009FC 9602 6002
         BR    14                        . 000A00 07FE
IOS00A02 MVI   2(6),X'FC'                . 000A02 92FC 6002
         BAL   4,IOS00A96                     CALL                     *
                                         . 000A06 4540 CA96
         LH    4,40(,7)                  . 000A0A 4840 7028
         A     4,DATA0860                . 000A0E 5A40 C860
         L     4,16(,4)                  . 000A12 5840 4010
         LA    4,0(,4)                   . 000A16 4140 4000
         LTR   4,4                       . 000A1A 1244
         BNZ   IOS00A24                  . 000A1C 4770 CA24
         OI    2(6),X'01'                . 000A20 9601 6002
IOS00A24 MVC   0(1,6),DATA005D           . 000A24 D200 6000 C05D
         MVI   1(6),X'08'                . 000A2A 9208 6001
         TM    36(7),X'C0'               . 000A2E 91C0 7024
         BO    IOS00A4E                  . 000A32 4710 CA4E
         TM    36(7),X'40'               . 000A36 9140 7024
         BZ    IOS00A42                  . 000A3A 4780 CA42
         OI    1(6),X'0A'                . 000A3E 960A 6001
IOS00A42 TM    36(7),X'10'               . 000A42 9110 7024
         BZ    IOS00A4E                  . 000A46 4780 CA4E
         OI    1(6),X'0C'                . 000A4A 960C 6001
IOS00A4E TM    DATA0058,X'03'            . 000A4E 9103 C058
         BO    IOS00AC2                  . 000A52 4710 CAC2
         CLI   20(7),X'01'               . 000A56 9501 7014
         BE    IOS00A62                  . 000A5A 4780 CA62
         OI    1(6),X'20'                . 000A5E 9620 6001
IOS00A62 MVC   12(4,8),4(6)              . 000A62 D203 800C 6004
         MVC   DATA0048(4),12(8)         . 000A68 D203 C048 800C
         TM    DATA005D,X'0F'            . 000A6E 910F C05D
         BZ    IOS00256                  . 000A72 4780 C256
         MVI   0(8),X'7F'                . 000A76 927F 8000
         BAL   4,IOS0051A                     CALL                     *
                                         . 000A7A 4540 C51A
         CLI   20(7),X'01'               . 000A7E 9501 7014
         BE    IOS00A8A                  . 000A82 4780 CA8A
         BAL   10,IOS002E8                    CALL                     *
                                         . 000A86 45A0 C2E8
IOS00A8A TM    1(6),X'06'                . 000A8A 9106 6001
         BZ    IOS00D38                  . 000A8E 4780 CD38
         B     IOS003B0                  . 000A92 47F0 C3B0
IOS00A96 L     5,20(,7)                  . 000A96 5850 7014
         L     9,0(5)                    . 000A9A 5895 0000
         ST    9,4(,6)                   . 000A9E 5090 6004
         CLI   20(7),X'01'               . 000AA2 9501 7014
         BER   4                         . 000AA6 0784
         AH    9,6(5)                    . 000AA8 4A95 0006
         ST    9,8(,6)                   . 000AAC 5090 6008
         BR    4                         . 000AB0 07F4
IOS00AB2 BAL   10,IOS00562                    CALL                     *
                                         . 000AB2 45A0 C562
         B     IOS00AC2                  . 000AB6 47F0 CAC2
IOS00ABA LA    2,240                     . 000ABA 4120 00F0
         B     IOS00D38                  . 000ABE 47F0 CD38
IOS00AC2 CLI   DATA005D,X'01'            . 000AC2 9501 C05D
         BH    IOS00B4E                  . 000AC6 4720 CB4E
         BE    IOS00B1A                  . 000ACA 4780 CB1A
         TM    2(6),X'04'                . 000ACE 9104 6002
         BZ    IOS00AFA                  . 000AD2 4780 CAFA
         BAL   10,IOS002AE                    CALL                     *
                                         . 000AD6 45A0 C2AE
         B     IOS00AFA                  . 000ADA 47F0 CAFA
         TM    0(6),X'0F'                . 000ADE 910F 6000
         BZ    IOS00AEE                  . 000AE2 4780 CAEE
         BAL   9,IOS00B6E                     CALL                     *
                                         . 000AE6 4590 CB6E
         B     IOS00AFA                  . 000AEA 47F0 CAFA
IOS00AEE CLI   20(7),X'01'               . 000AEE 9501 7014
         BE    IOS00AFA                  . 000AF2 4780 CAFA
         BAL   10,IOS00B14                    CALL                     *
                                         . 000AF6 45A0 CB14
IOS00AFA BAL   10,IOS00B14                    CALL                     *
                                         . 000AFA 45A0 CB14
         SR    2,2                       . 000AFE 1B22
         IC    2,0(,6)                   . 000B00 4320 6000
IOS00B04 NI    2(6),X'FB'                . 000B04 94FB 6002
         B     IOS00D38                  . 000B08 47F0 CD38
IOS00B0C LA    2,240                     . 000B0C 4120 00F0
         B     IOS00B04                  . 000B10 47F0 CB04
IOS00B14 LR    1,7                       . 000B14 1817
         SVC   69                             BSP                      *
                                         . 000B16 0A45
         BR    10                        . 000B18 07FA
IOS00B1A C     6,DATA0868                . 000B1A 5960 C868
         BE    IOS00D38                  . 000B1E 4780 CD38
         BAL   10,IOS00CB6                    CALL                     *
                                         . 000B22 45A0 CCB6
         BAL   10,IOS002AA                    CALL                     *
                                         . 000B26 45A0 C2AA
         NOP   0                         . 000B2A 4700 0000
         NOPR  0                         . 000B2E 0700
         BAL   1,IOS00B38                     PLIST                    *
                                         . 000B30 4510 CB38
         DC    X'00000000'               . 000B34 00000000
IOS00B38 ST    7,0(1)                    . 000B38 5071 0000
         MVI   0(1),X'90'                . 000B3C 9290 1000
         SVC   20                             CLOSE                    *
                                         . 000B40 0A14
         NI    2(6),X'37'                . 000B42 9437 6002
         BAL   9,IOS00B90                     CALL                     *
                                         . 000B46 4590 CB90
         B     IOS00D38                  . 000B4A 47F0 CD38
IOS00B4E BAL   10,IOS00CB6                    CALL                     *
                                         . 000B4E 45A0 CCB6
         BAL   10,IOS002AA                    CALL                     *
                                         . 000B52 45A0 C2AA
         B     IOS00B62                  . 000B56 47F0 CB62
         OI    48(7),X'80'               . 000B5A 9680 7030
         BAL   9,IOS00B6E                     CALL                     *
                                         . 000B5E 4590 CB6E
IOS00B62 NI    2(6),X'BF'                . 000B62 94BF 6002
         BAL   9,IOS00B90                     CALL                     *
                                         . 000B66 4590 CB90
         B     IOS00D38                  . 000B6A 47F0 CD38
IOS00B6E BAL   10,IOS00CB6                    CALL                     *
                                         . 000B6E 45A0 CCB6
         BAL   10,IOS002AA                    CALL                     *
                                         . 000B72 45A0 C2AA
         NOP   0                         . 000B76 4700 0000
         NOPR  0                         . 000B7A 0700
         BAL   1,IOS00B84                     PLIST                    *
                                         . 000B7C 4510 CB84
         DC    X'00000000'               . 000B80 00000000
IOS00B84 ST    7,0(1)                    . 000B84 5071 0000
         MVI   0(1),X'B0'                . 000B88 92B0 1000
         SVC   23                             CLOSE (TYPE=T)           *
                                         . 000B8C 0A17
         BR    9                         . 000B8E 07F9
IOS00B90 TM    2(6),X'10'                . 000B90 9110 6002
         BZR   9                         . 000B94 0789
         LR    1,7                       . 000B96 1817
         L     15,20(1)                  . 000B98 58F1 0014
         OI    23(1),X'01'               . 000B9C 9601 1017
         LH    14,4(15)                  . 000BA0 48EF 0004
         MH    14,6(15)                  . 000BA4 4CEF 0006
         TM    32(1),X'01'               . 000BA8 9101 1020
         BO    IOS00BB8                  . 000BAC 4710 CBB8
         LA    0,8(14)                   . 000BB0 410E 0008
         B     IOS00BBC                  . 000BB4 47F0 CBBC
IOS00BB8 LA    0,16(14)                  . 000BB8 410E 0010
IOS00BBC LA    1,0(15)                   . 000BBC 411F 0000
         SVC   10                             GETMAIN/FREEMAIN         *
                                         . 000BC0 0A0A
         NI    2(6),X'EF'                . 000BC2 94EF 6002
         BR    9                         . 000BC6 07F9
IOS00BC8 SR    0,0                       . 000BC8 1B00
         IC    0,20(,7)                  . 000BCA 4300 7014
         SLL   0,16                      . 000BCE 8900 0010
         AH    0,62(,7)                  . 000BD2 4A00 703E
         LR    1,7                       . 000BD6 1817
         STH   0,24(,1)                  . 000BD8 4000 1018
         SRL   0,16                      . 000BDC 8800 0010
         STH   0,22(,1)                  . 000BE0 4000 1016
         BAL   15,IOS00BF8                    CALL                     *
                                         . 000BE4 45F0 CBF8
         DC    A(DATA0BF0)               . 000BE8 00000BF0
         DC    X'00000000'               . 000BEC 00000000
DATA0BF0 DC    C'IECQBFG1'               . 000BF0 C9C5C3D8C2C6C7F1
IOS00BF8 SVC   6                              LINK/LINKX               *
                                         . 000BF8 0A06
         BAL   4,IOS00A96                     CALL                     *
                                         . 000BFA 4540 CA96
         OI    2(6),X'10'                . 000BFE 9610 6002
         BR    10                        . 000C02 07FA
IOS00C04 LA    2,8(,11)                  . 000C04 4120 B008
         LA    4,16                      . 000C08 4140 0010
         LH    5,2(,11)                  . 000C0C 4850 B002
         LA    5,0(5,11)                 . 000C10 4155 B000
IOS00C14 TM    3(2),X'01'                . 000C14 9101 2003
         BO    IOS00CAE                  . 000C18 4710 CCAE
         TM    15(2),X'01'               . 000C1C 9101 200F
         BZ    IOS00CAE                  . 000C20 4780 CCAE
         L     6,0(2)                    . 000C24 5862 0000
         LA    8,20(,6)                  . 000C28 4180 6014
         L     7,28(,6)                  . 000C2C 5870 601C
         LA    10,1(,6)                  . 000C30 41A0 6001
         C     10,DATA0868               . 000C34 59A0 C868
         BE    IOS00CAA                  . 000C38 4780 CCAA
         TM    48(7),X'10'               . 000C3C 9110 7030
         BZ    IOS00CA2                  . 000C40 4780 CCA2
         C     6,DATA0868                . 000C44 5960 C868
         BNE   IOS00C68                  . 000C48 4770 CC68
         STM   2,10,DATA00C4             . 000C4C 902A C0C4
         B     IOS00452                  . 000C50 47F0 C452
IOS00C54 LA    10,DATA0878               . 000C54 41A0 C878
         ST    10,DATA0864               . 000C58 50A0 C864
         LA    10,18                     . 000C5C 41A0 0012
         ST    10,DATA086C               . 000C60 50A0 C86C
         LM    2,10,DATA00C4             . 000C64 982A C0C4
IOS00C68 BAL   10,IOS00CB6                    CALL                     *
                                         . 000C68 45A0 CCB6
         BAL   10,IOS002AA                    CALL                     *
                                         . 000C6C 45A0 C2AA
         NOP   0                         . 000C70 4700 0000
         C     6,DATA0868                . 000C74 5960 C868
         BNE   IOS00C8A                  . 000C78 4770 CC8A
         OI    DATA086B,X'01'            . 000C7C 9601 C86B
         MVI   DATA0878,X'40'            . 000C80 9240 C878
         MVC   DATA0879(143),DATA0878    . 000C84 D28E C879 C878
IOS00C8A NOPR  0                         . 000C8A 0700
         BAL   1,IOS00C94                     PLIST                    *
                                         . 000C8C 4510 CC94
         DC    X'00000000'               . 000C90 00000000
IOS00C94 ST    7,0(1)                    . 000C94 5071 0000
         MVI   0(1),X'B0'                . 000C98 92B0 1000
         SVC   20                             CLOSE                    *
                                         . 000C9C 0A14
         BAL   9,IOS00B90                     CALL                     *
                                         . 000C9E 4590 CB90
IOS00CA2 LR    1,6                       . 000CA2 1816
         LA    0,128                     . 000CA4 4100 0080
         SVC   10                             GETMAIN/FREEMAIN         *
                                         . 000CA8 0A0A
IOS00CAA OI    3(2),X'01'                . 000CAA 9601 2003
IOS00CAE BXLE  2,4,IOS00C14              . 000CAE 8724 CC14
         B     IOS00D38                  . 000CB2 47F0 CD38
IOS00CB6 STM   2,10,DATA00C4             . 000CB6 902A C0C4
         TM    0(6),X'0F'                . 000CBA 910F 6000
         BZR   10                        . 000CBE 078A
         TM    1(6),X'04'                . 000CC0 9104 6001
         BZR   10                        . 000CC4 078A
         TM    1(6),X'08'                . 000CC6 9108 6001
         BOR   10                        . 000CCA 071A
         OI    1(6),X'08'                . 000CCC 9608 6001
         SR    3,3                       . 000CD0 1B33
         TM    36(7),X'40'               . 000CD2 9140 7024
         BZ    IOS00CDE                  . 000CD6 4780 CCDE
         SH    3,DATA0050                . 000CDA 4B30 C050
IOS00CDE A     3,16(,6)                  . 000CDE 5A30 6010
         BC    12,IOS00D22               . 000CE2 47C0 CD22
         BAL   10,IOS002AA                    CALL                     *
                                         . 000CE6 45A0 C2AA
         NOP   0                         . 000CEA 4700 0000
         CLI   20(7),X'01'               . 000CEE 9501 7014
         BE    IOS00CFA                  . 000CF2 4780 CCFA
         BAL   10,IOS002E8                    CALL                     *
                                         . 000CF6 45A0 C2E8
IOS00CFA TM    36(7),X'40'               . 000CFA 9140 7024
         BO    IOS00D16                  . 000CFE 4710 CD16
         LH    4,62(,7)                  . 000D02 4840 703E
         STH   3,62(,7)                  . 000D06 4030 703E
         BAL   10,IOS00324                    CALL                     *
                                         . 000D0A 45A0 C324
         STH   4,62(,7)                  . 000D0E 4040 703E
         B     IOS00D22                  . 000D12 47F0 CD22
IOS00D16 LM    4,5,12(6)                 . 000D16 9845 600C
         STH   5,0(4)                    . 000D1A 4054 0000
         BAL   10,IOS00324                    CALL                     *
                                         . 000D1E 45A0 C324
IOS00D22 LM    2,10,DATA00C4             . 000D22 982A C0C4
         BR    10                        . 000D26 07FA
IOS00D28 LA    1,218                     . 000D28 4110 00DA
         B     IOS001A8                  . 000D2C 47F0 C1A8
IOS00D30 LA    1,217                     . 000D30 4110 00D9
         B     IOS001A8                  . 000D34 47F0 C1A8
IOS00D38 L     13,4(,13)                 . 000D38 58D0 D004
         LM    14,1,12(13)               . 000D3C 98E1 D00C
         LM    4,12,36(13)               . 000D40 984C D024
         L     13,4(,13)                 . 000D44 58D0 D004
         LR    1,0                       . 000D48 1810
         B     6(,1)                     . 000D4A 47F0 1006
         DC    X'000085'                 . 000D4E 000085
DATA0D50 EQU   IHCFIOSH+3408             . 000D50
         DC    AL3(IOS0092A)             . 000D51 00092A
IOS00D54 BXLE  0,0,0                     . 000D54 8700 0000
IOS00D58 OI    1(6),X'50'                . 000D58 9650 6001
         TM    1(6),X'80'                . 000D5C 9180 6001
         BNOR  14                        . 000D60 07EE
         LR    4,14                      . 000D62 184E
         LA    15,0(,15)                 . 000D64 41F0 F000
         O     15,DATA0D70               . 000D68 56F0 CD70
         B     IOS00D74                  . 000D6C 47F0 CD74
DATA0D70 DC    X'02000000'               . 000D70 02000000
IOS00D74 SVC   68                             SYNADAF/SYNADRLS         *
                                         . 000D74 0A44
         LR    10,1                      . 000D76 18A1
         LA    0,112                     . 000D78 4100 0070
         BAL   1,IOS00D80                     PLIST                    *
                                         . 000D7C 4510 CD80
IOS00D80 SVC   10                             GETMAIN/FREEMAIN         *
                                         . 000D80 0A0A
         ST    1,DATA0134                . 000D82 5010 C134
         MVC   4(27,1),DATA0DC6          . 000D86 D21A 1004 CDC6
         MVC   31(77,1),50(10)           . 000D8C D24C 101F A032
         LA    10,104                    . 000D92 41A0 0068
         ST    10,0(,1)                  . 000D96 50A0 1000
         LA    15,0(,15)                 . 000D9A 41F0 F000
         NOPR  0                         . 000D9E 0700
         O     15,DATA0DA8               . 000DA0 56F0 CDA8
         B     IOS00DAC                  . 000DA4 47F0 CDAC
DATA0DA8 DC    X'FF000000'               . 000DA8 FF000000
IOS00DAC SVC   68                             SYNADAF/SYNADRLS         *
                                         . 000DAC 0A44
         BR    4                         . 000DAE 07F4
IOS00DB0 ST    10,DATA007C               . 000DB0 50A0 C07C
         BAL   9,IOS00B6E                     CALL                     *
                                         . 000DB4 4590 CB6E
         NI    2(6),X'BF'                . 000DB8 94BF 6002
         BAL   9,IOS00B90                     CALL                     *
                                         . 000DBC 4590 CB90
         L     10,DATA007C               . 000DC0 58A0 C07C
         BR    10                        . 000DC4 07FA
DATA0DC6 DC    C'IHC2'                   . 000DC6 C9C8C3F2
         MVO   2368(16,12),1737(9,12)    . 000DCA F1F8 C940 C6C9
         DC    C'OCS '                   . 000DD0 D6C3E240
         STD   4,2401(,12)               . 000DD4 6040 C961
         DC    C'O ERROR  '              . 000DD8 D640C5D9D9D6D940
         END   IHCFIOSH                  .
