IHCUATBL TITLE 'SPTS disassembly of IHCUATBL  8/06/24'
IHCUATBL CSECT                           . 000000
         DC    X'0000063006050607'       . 000000 0000063006050607
         DC    X'0000000170000320'       . 000008 0000000170000320
         DC    C'{'                      . 000010 C0
         DC    X'0200000000000100'       . 000011 0200000000000100
         DC    X'00000170000320C0'       . 000019 00000170000320C0
         DC    X'0200000000000100'       . 000021 0200000000000100
         DC    X'00000170000320C0'       . 000029 00000170000320C0
         DC    X'0200000000000100'       . 000031 0200000000000100
         DC    X'00000170000320C0'       . 000039 00000170000320C0
         DC    X'0200000000000100'       . 000041 0200000000000100
         DC    X'0000017000005080'       . 000049 0000017000005080
         DC    X'0200500000000100'       . 000051 0200500000000100
         DC    X'00000170000085C4'       . 000059 00000170000085C4
         DC    X'0200000000000100'       . 000061 0200000000000100
         DC    X'0000017000005080'       . 000069 0000017000005080
         DC    X'0200500000000100'       . 000071 0200500000000100
         DC    X'00000170000320C0'       . 000079 00000170000320C0
         DC    X'0200000000000100'       . 000081 0200000000000100
         DC    X'00000170000320C0'       . 000089 00000170000320C0
         DC    X'0200000000000100'       . 000091 0200000000000100
         DC    X'00000170000320C0'       . 000099 00000170000320C0
         DC    X'0200000000000100'       . 0000A1 0200000000000100
         DC    X'00000170000320C0'       . 0000A9 00000170000320C0
         DC    X'0200000000000100'       . 0000B1 0200000000000100
         DC    X'00000170000320C0'       . 0000B9 00000170000320C0
         DC    X'0200000000000100'       . 0000C1 0200000000000100
         DC    X'00000170000320C0'       . 0000C9 00000170000320C0
         DC    X'0200000000000100'       . 0000D1 0200000000000100
         DC    X'00000170000320C0'       . 0000D9 00000170000320C0
         DC    X'0200000000000100'       . 0000E1 0200000000000100
         DC    X'00000170000320C0'       . 0000E9 00000170000320C0
         DC    X'0200000000000100'       . 0000F1 0200000000000100
         DC    X'00000170000320C0'       . 0000F9 00000170000320C0
         DC    X'0200000000000100'       . 000101 0200000000000100
         DC    X'00000170000320C0'       . 000109 00000170000320C0
         DC    X'0200000000000100'       . 000111 0200000000000100
         DC    X'00000170000320C0'       . 000119 00000170000320C0
         DC    X'0200000000000100'       . 000121 0200000000000100
         DC    X'00000170000320C0'       . 000129 00000170000320C0
         DC    X'0200000000000100'       . 000131 0200000000000100
         DC    X'00000170000320C0'       . 000139 00000170000320C0
         DC    X'0200000000000100'       . 000141 0200000000000100
         DC    X'00000170000320C0'       . 000149 00000170000320C0
         DC    X'0200000000000100'       . 000151 0200000000000100
         DC    X'00000170000320C0'       . 000159 00000170000320C0
         DC    X'0200000000000100'       . 000161 0200000000000100
         DC    X'00000170000320C0'       . 000169 00000170000320C0
         DC    X'0200000000000100'       . 000171 0200000000000100
         DC    X'00000170000320C0'       . 000179 00000170000320C0
         DC    X'0200000000000100'       . 000181 0200000000000100
         DC    X'00000170000320C0'       . 000189 00000170000320C0
         DC    X'0200000000000100'       . 000191 0200000000000100
         DC    X'00000170000320C0'       . 000199 00000170000320C0
         DC    X'0200000000000100'       . 0001A1 0200000000000100
         DC    X'00000170000320C0'       . 0001A9 00000170000320C0
         DC    X'0200000000000100'       . 0001B1 0200000000000100
         DC    X'00000170000320C0'       . 0001B9 00000170000320C0
         DC    X'0200000000000100'       . 0001C1 0200000000000100
         DC    X'00000170000320C0'       . 0001C9 00000170000320C0
         DC    X'0200000000000100'       . 0001D1 0200000000000100
         DC    X'00000170000320C0'       . 0001D9 00000170000320C0
         DC    X'0200000000000100'       . 0001E1 0200000000000100
         DC    X'00000170000320C0'       . 0001E9 00000170000320C0
         DC    X'0200000000000100'       . 0001F1 0200000000000100
         DC    X'00000170000320C0'       . 0001F9 00000170000320C0
         DC    X'0200000000000100'       . 000201 0200000000000100
         DC    X'00000170000320C0'       . 000209 00000170000320C0
         DC    X'0200000000000100'       . 000211 0200000000000100
         DC    X'00000170000320C0'       . 000219 00000170000320C0
         DC    X'0200000000000100'       . 000221 0200000000000100
         DC    X'00000170000320C0'       . 000229 00000170000320C0
         DC    X'0200000000000100'       . 000231 0200000000000100
         DC    X'00000170000320C0'       . 000239 00000170000320C0
         DC    X'0200000000000100'       . 000241 0200000000000100
         DC    X'00000170000320C0'       . 000249 00000170000320C0
         DC    X'0200000000000100'       . 000251 0200000000000100
         DC    X'00000170000320C0'       . 000259 00000170000320C0
         DC    X'0200000000000100'       . 000261 0200000000000100
         DC    X'00000170000320C0'       . 000269 00000170000320C0
         DC    X'0200000000000100'       . 000271 0200000000000100
         DC    X'00000170000320C0'       . 000279 00000170000320C0
         DC    X'0200000000000100'       . 000281 0200000000000100
         DC    X'00000170000320C0'       . 000289 00000170000320C0
         DC    X'0200000000000100'       . 000291 0200000000000100
         DC    X'00000170000320C0'       . 000299 00000170000320C0
         DC    X'0200000000000100'       . 0002A1 0200000000000100
         DC    X'00000170000320C0'       . 0002A9 00000170000320C0
         DC    X'0200000000000100'       . 0002B1 0200000000000100
         DC    X'00000170000320C0'       . 0002B9 00000170000320C0
         DC    X'0200000000000100'       . 0002C1 0200000000000100
         DC    X'00000170000320C0'       . 0002C9 00000170000320C0
         DC    X'0200000000000100'       . 0002D1 0200000000000100
         DC    X'00000170000320C0'       . 0002D9 00000170000320C0
         DC    X'0200000000000100'       . 0002E1 0200000000000100
         DC    X'00000170000320C0'       . 0002E9 00000170000320C0
         DC    X'0200000000000100'       . 0002F1 0200000000000100
         DC    X'00000170000320C0'       . 0002F9 00000170000320C0
         DC    X'0200000000000100'       . 000301 0200000000000100
         DC    X'00000170000320C0'       . 000309 00000170000320C0
         DC    X'0200000000000100'       . 000311 0200000000000100
         DC    X'00000170000320C0'       . 000319 00000170000320C0
         DC    X'0200000000000100'       . 000321 0200000000000100
         DC    X'00000170000320C0'       . 000329 00000170000320C0
         DC    X'0200000000000100'       . 000331 0200000000000100
         DC    X'00000170000320C0'       . 000339 00000170000320C0
         DC    X'0200000000000100'       . 000341 0200000000000100
         DC    X'00000170000320C0'       . 000349 00000170000320C0
         DC    X'0200000000000100'       . 000351 0200000000000100
         DC    X'00000170000320C0'       . 000359 00000170000320C0
         DC    X'0200000000000100'       . 000361 0200000000000100
         DC    X'00000170000320C0'       . 000369 00000170000320C0
         DC    X'0200000000000100'       . 000371 0200000000000100
         DC    X'00000170000320C0'       . 000379 00000170000320C0
         DC    X'0200000000000100'       . 000381 0200000000000100
         DC    X'00000170000320C0'       . 000389 00000170000320C0
         DC    X'0200000000000100'       . 000391 0200000000000100
         DC    X'00000170000320C0'       . 000399 00000170000320C0
         DC    X'0200000000000100'       . 0003A1 0200000000000100
         DC    X'00000170000320C0'       . 0003A9 00000170000320C0
         DC    X'0200000000000100'       . 0003B1 0200000000000100
         DC    X'00000170000320C0'       . 0003B9 00000170000320C0
         DC    X'0200000000000100'       . 0003C1 0200000000000100
         DC    X'00000170000320C0'       . 0003C9 00000170000320C0
         DC    X'0200000000000100'       . 0003D1 0200000000000100
         DC    X'00000170000320C0'       . 0003D9 00000170000320C0
         DC    X'0200000000000100'       . 0003E1 0200000000000100
         DC    X'00000170000320C0'       . 0003E9 00000170000320C0
         DC    X'0200000000000100'       . 0003F1 0200000000000100
         DC    X'00000170000320C0'       . 0003F9 00000170000320C0
         DC    X'0200000000000100'       . 000401 0200000000000100
         DC    X'00000170000320C0'       . 000409 00000170000320C0
         DC    X'0200000000000100'       . 000411 0200000000000100
         DC    X'00000170000320C0'       . 000419 00000170000320C0
         DC    X'0200000000000100'       . 000421 0200000000000100
         DC    X'00000170000320C0'       . 000429 00000170000320C0
         DC    X'0200000000000100'       . 000431 0200000000000100
         DC    X'00000170000320C0'       . 000439 00000170000320C0
         DC    X'0200000000000100'       . 000441 0200000000000100
         DC    X'00000170000320C0'       . 000449 00000170000320C0
         DC    X'0200000000000100'       . 000451 0200000000000100
         DC    X'00000170000320C0'       . 000459 00000170000320C0
         DC    X'0200000000000100'       . 000461 0200000000000100
         DC    X'00000170000320C0'       . 000469 00000170000320C0
         DC    X'0200000000000100'       . 000471 0200000000000100
         DC    X'00000170000320C0'       . 000479 00000170000320C0
         DC    X'0200000000000100'       . 000481 0200000000000100
         DC    X'00000170000320C0'       . 000489 00000170000320C0
         DC    X'0200000000000100'       . 000491 0200000000000100
         DC    X'00000170000320C0'       . 000499 00000170000320C0
         DC    X'0200000000000100'       . 0004A1 0200000000000100
         DC    X'00000170000320C0'       . 0004A9 00000170000320C0
         DC    X'0200000000000100'       . 0004B1 0200000000000100
         DC    X'00000170000320C0'       . 0004B9 00000170000320C0
         DC    X'0200000000000100'       . 0004C1 0200000000000100
         DC    X'00000170000320C0'       . 0004C9 00000170000320C0
         DC    X'0200000000000100'       . 0004D1 0200000000000100
         DC    X'00000170000320C0'       . 0004D9 00000170000320C0
         DC    X'0200000000000100'       . 0004E1 0200000000000100
         DC    X'00000170000320C0'       . 0004E9 00000170000320C0
         DC    X'0200000000000100'       . 0004F1 0200000000000100
         DC    X'00000170000320C0'       . 0004F9 00000170000320C0
         DC    X'0200000000000100'       . 000501 0200000000000100
         DC    X'00000170000320C0'       . 000509 00000170000320C0
         DC    X'0200000000000100'       . 000511 0200000000000100
         DC    X'00000170000320C0'       . 000519 00000170000320C0
         DC    X'0200000000000100'       . 000521 0200000000000100
         DC    X'00000170000320C0'       . 000529 00000170000320C0
         DC    X'0200000000000100'       . 000531 0200000000000100
         DC    X'00000170000320C0'       . 000539 00000170000320C0
         DC    X'0200000000000100'       . 000541 0200000000000100
         DC    X'00000170000320C0'       . 000549 00000170000320C0
         DC    X'0200000000000100'       . 000551 0200000000000100
         DC    X'00000170000320C0'       . 000559 00000170000320C0
         DC    X'0200000000000100'       . 000561 0200000000000100
         DC    X'00000170000320C0'       . 000569 00000170000320C0
         DC    X'0200000000000100'       . 000571 0200000000000100
         DC    X'00000170000320C0'       . 000579 00000170000320C0
         DC    X'0200000000000100'       . 000581 0200000000000100
         DC    X'00000170000320C0'       . 000589 00000170000320C0
         DC    X'0200000000000100'       . 000591 0200000000000100
         DC    X'00000170000320C0'       . 000599 00000170000320C0
         DC    X'0200000000000100'       . 0005A1 0200000000000100
         DC    X'00000170000320C0'       . 0005A9 00000170000320C0
         DC    X'0200000000000100'       . 0005B1 0200000000000100
         DC    X'00000170000320C0'       . 0005B9 00000170000320C0
         DC    X'0200000000000100'       . 0005C1 0200000000000100
         DC    X'00000170000320C0'       . 0005C9 00000170000320C0
         DC    X'0200000000000100'       . 0005D1 0200000000000100
         DC    X'00000170000320C0'       . 0005D9 00000170000320C0
         DC    X'0200000000000100'       . 0005E1 0200000000000100
         DC    X'00000170000320C0'       . 0005E9 00000170000320C0
         DC    X'0200000000000100'       . 0005F1 0200000000000100
         DC    X'00000170000320C0'       . 0005F9 00000170000320C0
         DC    X'0200000000000100'       . 000601 0200000000000100
         DC    X'00000170000320C0'       . 000609 00000170000320C0
         DC    X'0200000000000100'       . 000611 0200000000000100
         DC    X'00000170000320C0'       . 000619 00000170000320C0
         DC    X'0200000000000100'       . 000621 0200000000000100
         DC    X'00000170000320C0'       . 000629 00000170000320C0
         DC    X'02000000000001'         . 000631 02000000000001
         END   IHCUATBL                  .
